
package com.mnt.preg.examitem.util.lifestyle;

import java.util.HashMap;
import java.util.Map;

/**
 * 生活方式调查工具类
 * 
 * @author xdc
 * @version 1.0
 * 
 *          变更履历：
 *          v1.0 2018-1-13 xdc 初版
 */
public class LifeStyleUtil {

    /**
     * 对应的建议
     */
    public static Map<Integer, String> suggestMap = new HashMap<Integer, String>();
    static {
        suggestMap.put(1, "偏食及不合理的营养会影响胎儿正常的生长发育，还会潜移默化的影响婴儿对辅食的接受和后续多样化膳食结构的建立。保证多样化的食物组成，是孕期营养需要的保障，应尽量将饮食接近平衡膳食。");
        suggestMap.put(2, "孕妇应保证三餐的规律性，呕吐严重者可增加餐次，以保证母婴优质的营养物质的供给。");
        suggestMap
                .put(3,
                        "过快的进餐速度，致使不能让食物得到充分的咀嚼，不但不利于口中食物和唾液淀粉酶的初步消化，而且还会进一步的加重肠胃负担。而且过短的咀嚼时间，会使迷走神经仍在过度兴奋之中，长此以往，容易因食欲亢进而肥胖。进餐时间应控制在20左右。");
        suggestMap.put(4, "适当减少在外用餐次数，多吃天然营养的食品，保障胎儿的营养供给。");
        suggestMap.put(5, "妊娠期需母体及胎儿均需求的正常营养供给，营养供给不足会给胎儿造成发育障碍，也会造成孕妇本身的贫血水肿等问题，建议每餐吃到七至八分饱");
        suggestMap.put(6, "胎儿不断发育，子宫增大后会向上靠近胃部，如果吃的过饱，可能会出现胃胀，胃部不适等表现，并且怀孕后胃肠道蠕动减慢，容易引起便秘。建议每餐吃到七至八分饱");
        suggestMap.put(7, "动物油热量高、胆固醇高，为保证孕期正常的体重增长，以及脂肪酸摄入的平衡，不建议过多食用");
        suggestMap.put(8, "偶尔摄入此类物质没有太大问题，但煎炸、烧烤类物质含有的致癌物质较多，多食容易造成胎儿畸形");
        suggestMap.put(9, "当伴有妊娠糖尿病风险时，请尽量避免烹饪时大量勾芡挂糊，以免增加菜品的血糖负荷，引起餐后血糖升高。");
        suggestMap.put(10, "合理的营养会影响胎儿正常的生长发育，还会潜移默化的影响婴儿对辅食的接受和后续多样化膳食结构的建立。保证多样化的食物组成，是孕期营养需要的保障，应尽量将饮食接近平衡膳食。");
        suggestMap.put(11, "在孕期存在脂肪储存增加的生理性改变，过度食用油脂容易引起孕期体重增长过快。建议控制油量的摄入");
        suggestMap.put(12, "孕妇在孕期胰岛功能存在生理性改变，过度食用糖是妊娠糖尿病的诱发因素之一，建议控制糖的摄入量。");
        suggestMap.put(13, "长期高盐饮食会增加高血压的风险，建议每天食用盐不要超过6g。");
        suggestMap.put(14, "辛辣会引起消化功能问题，会加大孕妇的消化不良、便秘、痔疮的症状");
        suggestMap.put(15, "孕妇活动太少会导致肠道蠕动减少，从而引起食欲下降、消化不良便秘等，对孕妇的健康也不利，甚至会使胎儿发育受阻，还会导致难产，建议每天进行30分钟的中等强度活动。");
        suggestMap.put(16, "孕期适当运动可调节神经系统功能，增加心肺活力。但是要避免长时间或激烈运动，以防导致胎儿不适，过度劳累。甚至造成胎儿流产。");
        suggestMap.put(17, "营造良好的睡眠环境，维持稳定的睡眠时间，保障良好的睡眠质量。");
        suggestMap.put(18, "孕妇的情绪与肾上腺有密切关系，孕妇妊娠期的情绪会对胎儿的发育造成影响，要保持积极的心态面对和适应不良情绪的产生。");
        suggestMap.put(19, "酒精会通过血流经胎盘进入胎儿的体内，出生时体重偏低的几率会有所上升。同时，在学习、说话、注意力、语言以及多动性等方面更容易出现问题。");
        suggestMap.put(20, "烟草中的氰化物影响胎儿的生长发育，导致先天性心脏病、腭裂、唇裂、智力低下等。尼古丁、氰化物、一氧化碳会导致胎儿缺氧和营养不良、发育迟缓。");
        suggestMap.put(21, "");
        suggestMap.put(22, "噪音会影响孕妇中枢系统的机能活动。长期处于50分贝的噪音环境下，会使内分泌腺体功能紊乱，并出现精神紧张和内分泌系统失调。严重者会造成胎儿缺氧缺血、导致胎儿畸形或流产。");
        suggestMap.put(23, "孕妇接触电磁辐射将直接影响到胎儿中枢神经和眼的发育，三个月后主要影响骨骼、泌尿及生殖系统。");
        suggestMap.put(24, "烟草中的氰化物影响胎儿的生长发育，导致先天性心脏病、腭裂、唇裂、智力低下等。尼古丁、氰化物、一氧化碳会导致胎儿缺氧和营养不良、发育迟缓。");
        suggestMap.put(25, "在尽量减少接触有害因素的同时，积极采取有效的补救措施，如孕期及时服用胎儿发育必须的营养素。把伤害降到最低。");
        suggestMap.put(26, "室内污染会造成新生儿体重降低、染色体异常，建议保持空气流通。");
        suggestMap.put(27, "在尽量减少接触有害因素的同时，积极采取有效的补救措施，如孕期及时服用胎儿发育必须的营养素。把伤害降到最低。");
        suggestMap.put(28, "非过滤水中含氯的有机物会不断分解成为有害的亚硝酸盐，对孕妇的内环境极为不利。");
        suggestMap.put(29, "加强室内空气流通，在室内放洁净空气的花草，改变室内环境。");
        suggestMap.put(30, "");
        suggestMap.put(31, "在尽量减少接触有害因素的同时，积极采取有效的补救措施，如孕期及时服用胎儿发育必须的营养素。把伤害降到最低。");
        suggestMap.put(32,
                "多晒太阳能促使孕妇的皮肤在日光紫外线的照射下制造维生素D，进而促进钙质的吸收和骨骼的生长，能加速人体抗体的合成，诱导并增强巨噬细胞对病原菌的吞噬作用，对入侵到机体内的病原微生物有杀灭作用。");
    }

    /**
     * 为了分析方便，定义一下map
     * map中的key对应选项id，
     * map中的value的数值0表示正常，其余表示异常，数据代买对应的建议
     */

    // 饮食
    public static Map<String, Integer> biteMap = new HashMap<String, Integer>();
    static {
        // 肉食型
        biteMap.put("11000022018011200080", 1);
        // 偏肉食型
        biteMap.put("11000022018011200081", 1);
        // 全素食型
        biteMap.put("11000022018011200087", 1);
        // 偏素食型（很少吃肉）
        biteMap.put("11000022018011200088", 1);
        // 蛋奶素型（荤类食品中只吃鸡蛋和牛奶）
        biteMap.put("11000022018011200089", 1);
        // 荤素搭配型
        biteMap.put("11000022018011200082", 0);
        // 荤素搭配型（不吃鸡肉）
        biteMap.put("11000022018011200083", 0);
        // 荤素搭配型（不吃牛羊肉）
        biteMap.put("11000022018011200084", 0);
        // 荤素搭配型（不吃猪肉）
        biteMap.put("11000022018011200085", 0);
        // 荤素搭配型（不吃鱼虾等水产品）
        biteMap.put("11000022018011200086", 0);
        // 一日三餐规律
        biteMap.put("11000022018011200090", 0);
        // 三餐不规律
        biteMap.put("11000022018011200091", 2);
        // 少食多餐
        biteMap.put("11000022018011200092", 0);
        // 5分钟之内
        biteMap.put("11000022018011200093", 3);
        // 5-10分钟
        biteMap.put("11000022018011200094", 3);
        // 10-20分钟
        biteMap.put("11000022018011200095", 0);
        // 20-30分钟
        biteMap.put("11000022018011200096", 0);
        // 30分钟以上
        biteMap.put("11000022018011200097", 0);
        // 从不在外用餐
        biteMap.put("11000022018011200273", 0);
        // 每周1-3次
        biteMap.put("11000022018011200274", 0);
        // 每周4-6次
        biteMap.put("11000022018011200275", 4);
        // 每周7次以上
        biteMap.put("11000022018011200276", 4);
        // 五分饱：没吃饱很难撑到下一餐
        biteMap.put("11000022018011200098", 5);
        // 六分饱：不太饱也不太饿，第二餐之前饿得很明显
        biteMap.put("11000022018011200099", 5);
        // 七分饱：胃里不满，但进食速度明显变慢，不再继续吃不会觉得饿，第二餐之前不会饿
        biteMap.put("11000022018011200100", 0);
        // 八分饱：胃里满了，但是还能再吃几口
        biteMap.put("11000022018011200101", 0);
        // 九分饱：能勉强吃几口，每口都是负担
        biteMap.put("11000022018011200102", 6);
        // 十分饱：一口都吃不进去了
        biteMap.put("11000022018011200103", 6);
        // 大豆调和油
        biteMap.put("11000022018011600023", 0);
        // 葵花橄榄调和油
        biteMap.put("11000022018011600024", 0);
        // 豆油
        biteMap.put("11000022018011600025", 0);
        // 葵花籽油
        biteMap.put("11000022018011600026", 0);
        // 橄榄油
        biteMap.put("11000022018011600027", 0);
        // 玉米油
        biteMap.put("11000022018011600028", 0);
        // 花生油
        biteMap.put("11000022018011600029", 0);
        // 葡萄籽油
        biteMap.put("11000022018011600030", 0);
        // 亚麻籽油/紫苏籽
        biteMap.put("11000022018011600031", 0);
        // 核桃油
        biteMap.put("11000022018011600032", 0);
        // 金龙鱼1:1:1调和油
        biteMap.put("11000022018011600033", 0);
        // 猪油
        biteMap.put("11000022018011600034", 7);
        // 炒菜
        biteMap.put("11000022018011200130", 0);
        // 蒸煮
        biteMap.put("11000022018011200131", 0);
        // 煲炖
        biteMap.put("11000022018011200132", 0);
        // 煎炸
        biteMap.put("11000022018011200133", 8);
        // 烤
        biteMap.put("11000022018011200134", 8);
        // 凉拌
        biteMap.put("11000022018011200135", 0);
        // 无特殊烹饪习惯
        biteMap.put("11000022018011200136", 0);
        // 勾芡
        biteMap.put("11000022018011200137", 9);
        // 几乎不放油
        biteMap.put("11000022018011200138", 10);
        // 清淡（少油少盐）
        biteMap.put("11000022018011200139", 0);
        // 高油（用餐时盘底有明显剩余油脂、或经常食用煎炸类食物）
        biteMap.put("11000022018011200140", 11);
        // 高糖（烹饪食物时习惯额外添加糖）
        biteMap.put("11000022018011200141", 12);
        // 高盐（过量的含钠调味品如酱油、味精等）
        biteMap.put("11000022018011200142", 13);
        // 重辣
        biteMap.put("11000022018011200143", 14);
    }

    // 运动
    public static Map<String, Integer> sportMap = new HashMap<String, Integer>();
    static {
        // 几乎无运动
        sportMap.put("11000022018011500083", 15);
        // 1～2次/周
        sportMap.put("11000022018011500084", 15);
        // 3～5次/周
        sportMap.put("11000022018011500085", 0);
        // ＞5次/周
        sportMap.put("11000022018011500086", 0);
        // 散步
        sportMap.put("11000022018011200148", 0);
        // 慢跑
        sportMap.put("11000022018011200149", 16);
        // 游泳
        sportMap.put("11000022018011200150", 0);
        // 爬楼梯
        sportMap.put("11000022018011200151", 0);
        // 舞蹈
        sportMap.put("11000022018011200152", 0);
        // 瑜伽/普拉提
        sportMap.put("11000022018011200153", 0);
        // 健身操
        sportMap.put("11000022018011200154", 0);
        // 力量锻炼
        sportMap.put("11000022018011200155", 16);
        // 太极拳
        sportMap.put("11000022018011200156", 0);
        // 其他
        sportMap.put("11000022018011200157", 0);
        // ＜30分钟
        sportMap.put("11000022018011200158", 15);
        // 30～60分钟
        sportMap.put("11000022018011200159", 0);
        // ＞60分钟
        sportMap.put("11000022018011200160", 16);
        // 晨起
        sportMap.put("11000022018011200162", 0);
        // 早餐后
        sportMap.put("11000022018011200163", 0);
        // 上午两餐之间
        sportMap.put("11000022018011200164", 0);
        // 午餐后
        sportMap.put("11000022018011200165", 0);
        // 下午两餐之间
        sportMap.put("11000022018011200166", 0);
        // 晚餐后
        sportMap.put("11000022018011200167", 0);
        // 其他
        sportMap.put("11000022018011200168", 0);
    }

    // 睡眠
    public static Map<String, Integer> sleepMap = new HashMap<String, Integer>();
    static {
        // 好
        sleepMap.put("11000022018011200169", 0);
        // 一般
        sleepMap.put("11000022018011200170", 0);
        // 差
        sleepMap.put("11000022018011200171", 17);
        // 入睡困难
        sleepMap.put("11000022018011200172", 17);
        // 夜间易醒或早醒
        sleepMap.put("11000022018011200173", 17);
        // 夜起
        sportMap.put("11000022018011200174", 17);
        // 多梦或噩梦中惊醒
        sleepMap.put("11000022018011200175", 17);
        // 熟睡时间短
        sleepMap.put("11000022018011200176", 17);
        // 夜间去厕所
        sleepMap.put("11000022018011200177", 17);
        // 呼吸不畅
        sleepMap.put("11000022018011200178", 17);
        // 感觉冷
        sleepMap.put("11000022018011200179", 17);
        // 感觉热
        sleepMap.put("11000022018011200180", 17);
        // 疼痛不适
        sleepMap.put("11000022018011200181", 17);
        // 其他
        sleepMap.put("11000022018011200182", 17);
        // ＜5小时
        sleepMap.put("11000022018011200183", 17);
        // 5～7小时
        sleepMap.put("11000022018011200184", 0);
        // 7～9小时
        sleepMap.put("11000022018011200185", 0);
        // ＞9小时
        sleepMap.put("11000022018011200186", 0);
    }

    // 心里
    public static Map<String, Integer> mentalityMap = new HashMap<String, Integer>();
    static {
        // 情绪低落，压抑或沮丧
        mentalityMap.put("11000022018011200208", 18);
        // 对人对事缺乏热情
        mentalityMap.put("11000022018011200209", 18);
        // 注意力集中有困难
        mentalityMap.put("11000022018011200210", 18);
        // 情绪激动或生气
        mentalityMap.put("11000022018011200211", 18);
        // 精神紧张，很难放松
        mentalityMap.put("11000022018011200212", 18);
        // 发脾气，没有耐性
        mentalityMap.put("11000022018011200213", 18);
        // 焦虑不安、心烦意乱
        mentalityMap.put("11000022018011200214", 18);
        // 心态很好，没有任何不良情绪
        mentalityMap.put("11000022018011200215", 0);
    }

    // 烟酒
    public static Map<String, Integer> drinkAndSomkeMap = new HashMap<String, Integer>();
    static {
        // 孕前经常喝，怀孕后不喝
        drinkAndSomkeMap.put("11000022018011200241", 0);
        // 孕前偶尔喝，怀孕后不喝
        drinkAndSomkeMap.put("11000022018011200242", 0);
        // 一直不喝
        drinkAndSomkeMap.put("11000022018011200243", 0);
        // 少量红酒
        drinkAndSomkeMap.put("11000022018011200244", 19);
        // 一直喝
        drinkAndSomkeMap.put("11000022018011200245", 19);
        // 不吸
        drinkAndSomkeMap.put("11000022018011200246", 0);
        // 吸烟
        drinkAndSomkeMap.put("11000022018011200247", 20);
        // 吸烟，已戒
        drinkAndSomkeMap.put("11000022018011200248", 21);
        // 被动吸烟（每天累计15分钟以上，且每周1天以上）
        drinkAndSomkeMap.put("11000022018011200249", 20);
    }

    // 环境
    public static Map<String, Integer> environmentMap = new HashMap<String, Integer>();
    static {
        // 无或很少
        environmentMap.put("11000022018011200252", 0);
        // 噪音、震动
        environmentMap.put("11000022018011200253", 22);
        // 电磁辐射
        environmentMap.put("11000022018011200254", 23);
        // 二手烟
        environmentMap.put("11000022018011200255", 24);
        // 粉尘
        environmentMap.put("11000022018011200256", 25);
        // 杀虫剂
        environmentMap.put("11000022018011200257", 25);
        // 干洗衣物
        environmentMap.put("11000022018011200258", 25);
        // 化学污染（毒素环境、重金属）
        environmentMap.put("11000022018011200259", 25);
        // 空气污染
        environmentMap.put("11000022018011200260", 25);
        // 建筑装修污染
        environmentMap.put("11000022018011200261", 26);
        // 烹饪油烟
        environmentMap.put("11000022018011200262", 27);
        // 饮用非过滤水
        environmentMap.put("11000022018011200263", 28);
        // 通风不良
        environmentMap.put("11000022018011200264", 29);
        // 牙齿金属填充物（银汞合金、镍铬合金）
        environmentMap.put("11000022018011200265", 30);
        // 其他_____
        environmentMap.put("11000022018011200266", 31);
        // 几乎没有
        environmentMap.put("11000022018011200267", 32);
        // 很少、每天＜30分钟
        environmentMap.put("11000022018011200268", 32);
        // 每天晒0.5-2小时太阳
        environmentMap.put("11000022018011200269", 0);
    }

}
